const background = `
# 活動背景
我們希望鼓勵中山人共同參與，提出對校園生活、學習進修等方面升級優化的解決方案，進而透過分析、討論，及競賽、評選等方式共同協力，運用開放資料，集思廣益，提升校園系統安全，創造更友善校園環境。同時推動學校開放原始碼(open source)。

# 活動目標
因此本活動設置的目標就是建立一個讓中山人共同協作的平台，讓中山人得以自下而上，發現問題解決問題。就如同g0v的精神：「不要問為何沒有人做這個，先承認你就是『沒有人』」。因為，「沒有人」是萬能的。就讓我們成為「沒有人」。
`;

const rule = `
# 參加條件
為中山大學在校教職員生

# 活動內容
本活動分兩階段，提案徵稿與黑客松。

## 提案徵稿
募集對中山大學的資訊系統創新或改進的構想。
詳閱本規範與活動說明後，可於線上【許願池】進行提案。

## 黑客松
依提案徵稿項目之投票結果最高 5 項，進行實作。
詳閱本規範與活動說明後，可於線上【報名連結】組隊報名。
將會依[「COVID-19(武漢肺炎)」防疫新生活運動：實聯制措施指引](https://www.cdc.gov.tw/File/Get/t-_Xs5DDee2qzBFC1fRXJA)建立實聯制相關措施。

# 使用條款
本活動，符合參加條件者皆可以於黑客松許願池提出問題，討論公共服務領域，並嘗試改進學校系統服務的網路平台。

本站上的討論，是學校和師生共同構思、解決問題過程的一環。為了保障討論的品質，參加者必須同意本站的使用規範，若違反本規範，主辦單位有權取消其資格。
# 規範事項
在參與本活動時，您同意：
* 您對您發佈的內容負責，並同意以 [CC BY 4.0](https://creativecommons.org/licenses/by/4.0/deed.zh_TW) 授權釋出。
* 您理解此項授權不可撤銷，並同意以超鏈結或網址作為充分的標示要件。

您發佈的內容（包括文字及圖片）不會：
* 誣衊或誹謗他人，或侵犯他們的隱私權
* 侮辱他人的性別認同或表徵、種族、階級、民族、國籍、宗教、性取向、年齡、外貌、懷孕狀態或身心障礙
* 辱罵、猥褻或恐嚇
* 侵犯他人的著作權或商標權
* 推銷商業產品或服務
* 與本站台宗旨（討論問題）無關
* 申訴個人案件並請求解決
* 對特定族群做出攻擊發言

您同意避免下列行為：
* 試圖中斷網站的運行，或妨礙他人使用網站
* 在違反 CC BY 授權的情況下使用本網站的內容

主辦單位可編輯或刪除任何違反此準則的內容。如果您不遵循上述這些原則，或者以其他方式侵犯其他參與者的權利，您的帳戶可能遭到停用。

# 用戶註冊
如果您想在網站上發佈意見，或支援其他人的意見，您必須註冊為用戶(Hackmd)。如果您只是想關注討論，則無需註冊。

我們可能會請邀您填寫問卷，但不會向第三方洩露您的電子郵件地址，或將它用於與本專案無關聯的任何其他用途上。


# 參與討論
註冊(Hackmd)之後，您可以對特定提案發表評論、回覆別人的意見，或為其他人的意見按讚，也可以只關注討論而不發言。

我們會定期整理本站的討論內容，但不會洩露您未主動公開的任何個人資訊。

您在網站上發佈的任何意見、回覆或按讚都是公開資訊，所有人都可以看到。

# 系統維護
在您發表評論之後，主辦單位可能會進一步詢問關於您經驗的補充問題，幫助您有效參與討論。

我們的版主力求保持中立和客觀，幫助您做出明確和翔實的評論，無論您是支持還是反對行政機關的提案。

您可以隨時停止使用本網站，也可以聯繫我們，要求刪除您的用戶名稱。

專案團隊可能會更新本頁面以修訂使用條款，並公告在進站訊息裡。

如果您繼續使用本站，即表明您同意遵守修訂後的版本。

再次感謝您參與 2020 吱吱盃黑客松！

# 本規範編寫參考
[總統盃黑客松活動規範](https://hackmd.io/@UqrMR_FQTwmPEgfZOKZLBw/H1eeZM1J8)
`;

const desc = `
# 提案徵稿
## 提案徵稿資格與限制
- 資格:
    - 中山大學在校教職員生，且已註冊本平台(Hackmd)帳號。
- 限制:
    - 提案必須是軟體類型(註：物聯網裝置亦可)，跟中山大學有關。
## 提案徵稿時間
2020年9月2日(三)
至
2020年11月8日(日)

## 提案徵稿方式
原則上依處室做為分類，於本活動之許願池依相對應分類填寫，[統一格式](/8vETBU5WTA2C9nkP_Sn87g)之提案。

## 提案徵稿格式
參考[提案範例](/8vETBU5WTA2C9nkP_Sn87g)

## 提案投票
依學號登入投票，每人 99 票
投票期間皆可進行修改或重新投票

## 投票時間
2020年11月16日(一)
至
2020年11月30日(一)

## 投票網址
待公布

# 黑客松

## 黑客松資格、限制與建議
- 資格:
    - 符合參加條件者，組隊報名參加，一隊以 6 人為上限。
- 限制:
    - 必須依提案徵稿項目之投票結果最高 5 項，進行實作。
    - 不得違反校方資訊系統之原始合約。
    - 不得利用非法方式取得、利用、販售敏感資料。如有發現資料洩漏，應立即通報主辦單位。
- 建議:
    - 一組程式設計 2 人以上
    - 一組美術 1 人以上
    - 一組企劃 1 人
    - 鼓勵偷跑先做

## 黑客松時間與場地
- 時間:
    - 2020 年 12 月 11 日 18:30 至 2020 年 12 月 13 日 20:00 (GMT+8)
- 場地:
    - 國立中山大學電資大樓 5012 室

## 黑客松評審
>[name=楊志璿] 希望找的人：校長、社師、學校重要處室主任、資工系主任

## 黑客松額外福利
現場提供一日四餐吃到飽

# 智慧財產權聲明
1. 提案徵稿入圍黑客松之參賽提案，其智慧財產權歸屬黑客松實現之團隊與提案人共同擁有。
2. 參賽團隊擔保提供予本活動之參賽資訊，包括但不限於參賽提案、圖文、簡報、影音及其他資料，並無侵害他人之智慧財產權、其他權利或違反法令之情事。
3. 提案徵稿入圍之參賽團隊同意將其為參加本活動所提供之圖文、簡報、照片、影音及其他資料（包括但不限於參賽團隊成員之姓名、肖像等，但不包括參賽產出之程式、軟體、系統），無償授權主辦單位或協辦單位以不限區域、時間、次數及非營利之方式使用（包括但不限於印刷、展示、宣傳、報導、出版或公開），或再授權第三人使用，並同意主辦單位得改作、重製或編輯及行使其他著作權法上著作財產權人所得享有之一切權利於相關行銷媒體，且主辦單位均不另予通知參賽團隊。如未涉及著作人格之誣衊，參賽團隊及其成員同意對主辦單位不行使著作人格權。
4. 參賽團隊同意無償授權主辦單位或協辦單位得於本活動進行過程中，拍攝、錄影或請參賽團隊提供相關照片或動態影像，做為紀錄、宣傳推廣、行銷本活動或相關活動之用，並得以任何形式發表前述之相片或動態影像。
5. 提案徵稿入圍之參賽提案，主辦單位自獲選名單公布後，可就參賽提案本身及衍生之智慧財產權轉讓或授權事宜，享有優先洽談合作之權利。

### 備註：
若提案受COVID-19(武漢肺炎)疫情之影響，主辦單位有權暫停本計畫。
`;

const award = `award`;

const join = `join`;

const contact = `contact`;

function replaceLink(text) {
    var matchs = /\[(.+)\]\((https?:\/\/[^\s]+)(?: "(.+)")?\)|(https?:\/\/[^\s]+)/ig.exec(text);
    return matchs ? `<a href="${matchs[2]}">${matchs[1]}</a>` : text;
}

function parseMarkdown(text) {
    let res = '';
    text.split('\n').forEach(element => {
        txt = element.trim();
        if (txt.length == 0) {
            return;
        }
        txt = replaceLink(txt);
        let i = 0, tag = 'p';
        while (txt[i] == '#') i++;
        if (i) {
            tag = `h${i}`;
            txt = txt.slice(i).trim();
        }
        res += `<${tag}>${txt}</${tag}>`;
    });
    return res;
}

window.onload = () => {
    let text = {
        background: background,
        rule: rule,
        desc: desc,
        award: award,
        join: join,
        contact: contact
    };
    let content = document.getElementById('content');
    let btns = document.getElementsByClassName('list')[0].children;
    let quit = document.getElementById('quit');
    let list = document.getElementById('list');
    let console = document.getElementsByClassName('console');
    function clickMan(e) {
        content.innerHTML = parseMarkdown(text[e.target.getAttribute('name')]);
        list.classList.add('hide');
        for (let i of console) {
            i.classList.add('hide');
        }
        quit.classList.remove('hide');
    }
    for (ele of btns) {
        ele.addEventListener('click', clickMan);
    }
    document.getElementById('q').addEventListener('click', (e) => {
        list.classList.remove('hide');
        for (let i of console) {
            i.classList.remove('hide');
        }
        quit.classList.add('hide');
    });
};